# ExternalResourceType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceType Properties
ExternalResourceType Class See Also
---
The ExternalResourceType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Guid | The Guid of GUID-based enum object.  (Inherited from GuidEnum.) |

# See Also
ExternalResourceType Class
Autodesk.Revit.DB Namespace